#+TITLE: TOP500 list web scraping
#+DATE: <2018-04-12 Thu>
#+AUTHOR: Pep Turró Mauri
#+LANGUAGE: en

This is a project to do web scraping of the [[https://www.top500.org/][TOP500 list]], which is a list of the
500 most powerful commercially available computers in the world.

The goal of this project is to extract the details of the computers from the
lists presented in the web site as HTML tables and store them in CSV format for
later processing.

* Collected dataset

The attached dataset is the full collection of TOP500 lists, i.e. starting
from the first available list from June 1993. It was collected like this:

#+BEGIN_EXAMPLE
$ time python3 -u scrape.py --year 1993 --month 6 > scraping.log

real	45m39,544s
user	9m23,815s
sys	0m2,897s
#+END_EXAMPLE

While exploring the collected dataset, a bug was detected in a specific system
and also [[https://github.com/codificat/top500/issues/1][in the code]] (that didn't properly detect and handle the unexpexted
value). The problem is in [[https://www.top500.org/system/178385][Faris -
Cluster Platform SL230s Gen8, Intel Xeon E5-2680v2 10C 2.8GHz, Infiniband QDR]],
that at the time of this data collection was listing /-1 GB/ of memory. The code
didn't expect negative memory values and just let it through "as is", resulting
in an invalid value in the dataset.  To avoid a full re-collection of the
dataset, the 8 entries for that system were manually fixed in the dataset,
leaving its memory information empty.

While adding the dataset in the repo, [[https://github.com/codificat/top500/issues/2][another problem]] was detected:

#+BEGIN_EXAMPLE
fatal: LF reemplaçaria CRLF en data/top500.csv.
#+END_EXAMPLE

it turns out that the way ~argparse~ opens the output file is not quite what
~csv.write~ handles best, and the resulting output file used CRLF for line ends.
This was also manually collected in the file.

A quick overview of the resulting dataset structure as loaded from R:

#+BEGIN_SRC R :results output :exports both
  col.classes <- c(
      'year'        = 'factor',
      'month'       = 'factor',
      'site_id'     = 'factor',
      'system_id'   = 'factor',
      'name'        = 'character',
      'site_name'   = 'character',
      'system_url'  = 'character'
  )
  top500 <- read.csv('data/top500.csv',
                     na.strings = '',
                     colClasses = col.classes)
  str(top500)
#+END_SRC

#+RESULTS:
#+begin_example
'data.frame':	25000 obs. of  25 variables:
 $ site_name   : chr  "Los Alamos National Laboratory" "Minnesota Supercomputer Center" "National Security Agency" "NCSA" ...
 $ system_url  : chr  "http://www.acl.lanl.gov/" NA NA NA ...
 $ manufacturer: Factor w/ 124 levels "Acer Group","ACTION",..: 118 118 118 118 81 81 118 59 20 20 ...
 $ cores       : int  1024 544 512 512 4 4 256 512 16 16 ...
 $ memory      : int  NA NA NA NA NA NA NA NA NA NA ...
 $ processor   : Factor w/ 463 levels "Alpha  1.25GHz",..: 312 312 312 312 130 129 312 74 26 26 ...
 $ interconnect: Factor w/ 71 levels "100G Ethernet",..: 28 28 28 28 50 50 28 NA NA NA ...
 $ rmax        : num  59.7 30.4 30.4 30.4 23.2 20 15.1 13.9 13.7 13.7 ...
 $ rpeak       : num  131 69.6 65.5 65.5 25.6 22 32.8 20.5 15.2 15.2 ...
 $ nmax        : int  52224 36864 36864 36864 6400 6144 26112 25000 10000 10000 ...
 $ nhalf       : int  24064 16384 16384 16384 830 832 12032 7500 650 650 ...
 $ hpcg        : num  NA NA NA NA NA NA NA NA NA NA ...
 $ power       : num  NA NA NA NA NA NA NA NA NA NA ...
 $ os          : Factor w/ 72 levels "AIX","Bullx Linux",..: 7 7 7 7 50 50 7 26 62 62 ...
 $ compiler    : Factor w/ 100 levels "CCE","cce 8.0",..: NA NA NA NA NA NA NA NA NA NA ...
 $ math        : Factor w/ 70 levels "-","2017.0.2",..: NA NA NA NA NA NA NA NA NA NA ...
 $ mpi         : Factor w/ 103 levels "bullx MPI","bullxmpi 1.1.11.1",..: NA NA NA NA NA NA NA NA NA NA ...
 $ gpu         : Factor w/ 508 levels "1 GHz","1.25 GHz",..: NA NA NA NA NA NA NA NA NA NA ...
 $ country     : Factor w/ 59 levels "Australia","Austria",..: 57 57 57 57 26 7 57 57 57 57 ...
 $ site_id     : Factor w/ 2853 levels "47223","47224",..: 809 881 980 925 927 107 989 233 324 338 ...
 $ system_id   : Factor w/ 10421 levels "166659","166660",..: 188 248 247 246 3217 3216 214 317 4740 4742 ...
 $ name        : chr  "CM-5/1024" "CM-5/544" "CM-5/512" "CM-5/512" ...
 $ year        : Factor w/ 25 levels "1993","1994",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ month       : Factor w/ 2 levels "11","6": 2 2 2 2 2 2 2 2 2 2 ...
 $ rank        : int  1 2 3 4 5 6 7 8 9 10 ...
#+end_example

There are 50 lists, at 500 entries each, totaling the 25.000 observations. We
can see it covers data for 10.421 systems (different system_id) from 2.853 sites
(site_id) located in 59 countries.
